import streamlit as st

st.set_page_config(page_title="DIGITAL HACK NN 2024", layout="wide")

st.title("Предсказание раннего выхода на пенсию")

# st.write(
#     "В рамках хакатона MARKING HACK команда Punk Butterfly разработала сервис, взаимодействующий с системой маркировки\
#      'ЧЕСТНЫЙ ЗНАК', с помощью которого государство может выявлять потенциально подозрительные на мошенничество точки \
#      продажи, выявлять монополии среди поставщиков, а также регионы, в которых потенциально может возникнуть дефицит на товары.")

st.write("Навигация по сайту находится в левом выпадающем меню")

st.write("---")
st.subheader("Predict")
st.write("Предсказание раннего выхода на пенсию, используя модели машинного обучения, а также интерпритируемость результатов")

st.write("---")
st.subheader("Analys")
st.write("Анализ макроэкономических показателей")